In [3]:
# Create different type Series Object datatypes (Array,Dictionary,Scalar)
import pandas as pd

data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
import pandas as pd

data = [1,2,3,4,5]
# series = pd.Series(data)
# Changing the index name
series = pd.Series(data, index=['a','b','c','d','e'])
print(series)
print(series['a':'c'])
print(type(series))

a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# List
import pandas as pd
data = [[1,2,3,4,5],[2,3,4]]
df = pd.DataFrame(data)
df

   0  1  2    3    4
0  1  2  3  4.0  5.0
1  2  3  4  NaN  NaN

In [26]:
# Dictionary
import pandas as pd
data = {"a": [1,2,3,4,5],"b": [2,3,4,5,6]}
df = pd.DataFrame(data)
df

   a  b
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

In [10]:
# Dictionary
import pandas as pd
data = {"fruits": ['apple','mango','banana'],"count": [2,3,4]}
df = pd.DataFrame(data)
df

   fruits  count
0   apple      2
1   mango      3
2  banana      4

In [24]:
# Creating a DataFrame from Numpy Nd Array:
import numpy as np
import pandas as pd
data = np.array([[1,2,3],[4,5,6]])
print(data)
df = pd.DataFrame(data)
df
print(type(df))

[[1 2 3]
 [4 5 6]]
<class 'pandas.core.frame.DataFrame'>

# Join

In [31]:
import pandas as pd
df1 = pd.DataFrame({"A": [1,2,3],"B":[2,3,4]})
df1

   A  B
0  1  2
1  2  3
2  3  4

In [30]:
df2 = pd.DataFrame({"A": [3,4,5],"C":[1,9,10]})
df2

   A   C
0  3   1
1  4   9
2  5  10

In [34]:
# concat  ###Concat basically do an outer jon of the two datasets
pd.concat([df1,df2])

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   NaN
0  3  NaN   1.0
1  4  NaN   9.0
2  5  NaN  10.0

In [45]:
#concat_Innerjoin
pd.concat([df1,df2],axis=1, join="inner")

   A  B  A   C
0  1  2  3   1
1  2  3  4   9
2  3  4  5  10

In [62]:
#concat_Outerjoin
pd.concat([df1,df2],axis=1, join="outer")

   A  B  A   C
0  1  2  3   1
1  2  3  4   9
2  3  4  5  10

In [57]:
# Merge will return the exact output as SQL joins 
pd.merge(df1,df2,on=["A"],how="inner")
# pd.merge(df1,df2,how="inner")

   A  B  C
0  3  4  1

In [58]:
pd.merge(df1,df2,how="outer")

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   1.0
3  4  NaN   9.0
4  5  NaN  10.0

In [59]:
pd.merge(df1,df2,how="right")

   A    B   C
0  3  4.0   1
1  4  NaN   9
2  5  NaN  10

In [60]:
pd.merge(df1,df2,how="left")

   A  B    C
0  1  2  NaN
1  2  3  NaN
2  3  4  1.0